rushxrushx/stm32f4_usbaudio2/uac2-205/lib/usart.c
#include "stm32f4xx_conf.h"
#include "usart.h"

#define TX_LEN  	200
static u16	tx_write_p;
static u16	tx_read_p;
static u16 tx_ovr=0;
static u8 tx_runing=0;
static u8  tx_buf[TX_LEN+4];


//串口1中断服务程序
//注意,读取USARTx->SR能避免莫名其妙的错误   	
u8 USART_RX_BUF[USART_REC_LEN];     //接收缓冲,最大USART_REC_LEN个字节.
//接收状态
//bit15，	接收完成标志
//bit14，	接收到0x0d
//bit13~0，	接收到的有效字节数目
u16 USART_RX_STA=0;       //接收状态标记	



void tx_fill()
{
	u16 next_p;
	
	if(tx_read_p!=tx_write_p)
	{
	tx_runing=1;
	USART1->DR = (u8) tx_buf[tx_read_p]; 
	
	//计算next p
	next_p=tx_read_p+1;
	if (next_p >= TX_LEN ) next_p=0;	
	
	tx_read_p=next_p;
	}
	else
	{
	USART_ITConfig(USART1, USART_IT_TXE, DISABLE);
	tx_runing=0;
	}
	
}


//////////////////////////////////////////////////////////////////


//1:使用ring buf
#if 1
//重定义fputc函数 
void fputc ( void* p, char ch)
{ 	
	
	u16 next_p;
	//计算即将写入的位置
	next_p=tx_write_p + 1 ;
	if (next_p >= TX_LEN ) next_p=0;	
	
	if (next_p != tx_read_p ) 
	{
		tx_buf[tx_write_p]=(u8) ch; 
		tx_write_p=next_p;
	}
	else
	{
	tx_ovr++;
	}
	
	//开启发送
	if(tx_runing==0) USART_ITConfig(USART1, USART_IT_TXE, ENABLE);
	

}
#else
//重定义fputc函数 
u8 fputc(void* p, char ch)
{ 	
	while((USART1->SR&0X40)==0);//循环发送,直到发送完毕   
	USART1->DR = (u8) ch;      

}
#endif
//初始化IO 串口1 
//bound:波特率
void uart_init(u32 bound){
   //GPIO端口设置
  GPIO_InitTypeDef GPIO_InitStructure;
	USART_InitTypeDef USART_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;
	
	//RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA,ENABLE); //使能GPIOA时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1,ENABLE);//使能USART1时钟
 
	//串口1对应引脚复用映射
	GPIO_PinAFConfig(GPIOA,GPIO_PinSource9,GPIO_AF_USART1); //GPIOA9 uart1 TX
	GPIO_PinAFConfig(GPIOB,GPIO_PinSource7,GPIO_AF_USART1); //mod to PB7 u1RX //GPIOA10 uart RX
	
	//USART1端口配置
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9 ;//| GPIO_Pin_10; //GPIOA9与GPIOA10
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;//复用功能
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;	//速度50MHz
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP; //推挽复用输出
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP; //上拉
	GPIO_Init(GPIOA,&GPIO_InitStructure); //初始化PA
	
	  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7; //pb7
	  GPIO_Init(GPIOB,&GPIO_InitStructure);//PB

   //USART1 初始化设置
	USART_InitStructure.USART_BaudRate = bound;//波特率设置
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;//字长为8位数据格式
	USART_InitStructure.USART_StopBits = USART_StopBits_1;//一个停止位
	USART_InitStructure.USART_Parity = USART_Parity_No;//无奇偶校验位
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;//无硬件数据流控制
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;	//收发模式
  USART_Init(USART1, &USART_InitStructure); //初始化串口1
	
  USART_Cmd(USART1, ENABLE);  //使能串口1 
	
	USART_ClearFlag(USART1, USART_FLAG_TC);
	
	
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);//开启相关中断


	//Usart1 NVIC 配置
  NVIC_InitStructure.NVIC_IRQChannel = USART1_IRQn;//串口1中断通道
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority=3;//抢占优先级3
	NVIC_InitStructure.NVIC_IRQChannelSubPriority =3;		//子优先级3
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;			//IRQ通道使能
	NVIC_Init(&NVIC_InitStructure);

	tx_write_p=0;
	tx_read_p=0;
	init_printf(fputc);
}

void USART1_IRQHandler(void)                	//串口1中断服务程序
{
	u8 Res;


	if(USART_GetITStatus(USART1, USART_IT_TXE) != RESET)
	{
	tx_fill();
	USART_ClearITPendingBit(USART1, USART_IT_TXE);
	}	

	if(USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)  //接收中断(接收到的数据必须是0x0d 0x0a结尾)
	{
		Res =USART_ReceiveData(USART1);//(USART1->DR);	//读取接收到的数据
		
		if((USART_RX_STA&0x8000)==0)//接收未完成
		{
			if(USART_RX_STA&0x4000)//接收到了0x0d
			{
				if(Res!=0x0a)USART_RX_STA=0;//接收错误,重新开始
				else USART_RX_STA|=0x8000;	//接收完成了 
			}
			else //还没收到0X0D
			{	
				if(Res==0x0d)USART_RX_STA|=0x4000;
				else
				{
					USART_RX_BUF[USART_RX_STA&0X3FFF]=Res ;
					USART_RX_STA++;
					if(USART_RX_STA>(USART_REC_LEN-1))USART_RX_STA=0;//接收数据错误,重新开始接收	  
				}		 
			}
		}   		 
  } 

}

 



